In [1]:
import numpy as np
import sklearn
import pandas as pd

In [2]:
df=pd.read_csv("train.csv")

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [5]:
df.shape

(891, 12)

In [6]:
df.drop(['PassengerId','Name','SibSp','Parch','Cabin','Embarked','Ticket'] ,axis='columns', inplace=True)#inplace is used to update dataframe

In [7]:
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [8]:
df.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
Fare          0
dtype: int64

In [9]:
df['Age'].mean()

29.69911764705882

In [10]:
df['Age'].fillna(29,inplace=True)

In [11]:
df.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
Fare        0
dtype: int64

In [12]:
dummies=pd.get_dummies(df.Sex)

In [13]:
dummies

     female  male
0         0     1
1         1     0
2         1     0
3         1     0
4         0     1
..      ...   ...
886       0     1
887       1     0
888       1     0
889       0     1
890       0     1

[891 rows x 2 columns]

In [14]:
df=pd.concat((df,dummies),axis='columns')

In [15]:
df=df.drop('Sex',axis='columns')

In [16]:
x=df.drop('Survived',axis='columns')
y=df['Survived']

In [17]:
x

     Pclass   Age     Fare  female  male
0         3  22.0   7.2500       0     1
1         1  38.0  71.2833       1     0
2         3  26.0   7.9250       1     0
3         1  35.0  53.1000       1     0
4         3  35.0   8.0500       0     1
..      ...   ...      ...     ...   ...
886       2  27.0  13.0000       0     1
887       1  19.0  30.0000       1     0
888       3  29.0  23.4500       1     0
889       1  26.0  30.0000       0     1
890       3  32.0   7.7500       0     1

[891 rows x 5 columns]

In [18]:
y

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [19]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [20]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=47)

In [22]:
print(len(x_train))
print(len(x_test))
print(len(y_train))
print(len(y_test))

712
179
712
179

In [23]:
model.fit(x_train,y_train)

GaussianNB()

In [24]:
model.score(x_test,y_test)

0.8100558659217877

In [29]:
x_test

     Pclass   Age    Fare  female  male
761       3  41.0   7.125       0     1
664       3  20.0   7.925       0     1
808       2  39.0  13.000       0     1
331       1  45.5  28.500       0     1
20        2  35.0  26.000       0     1
..      ...   ...     ...     ...   ...
265       2  36.0  10.500       0     1
303       2  29.0  12.350       1     0
594       2  37.0  26.000       0     1
160       3  44.0  16.100       0     1
741       1  36.0  78.850       0     1

[179 rows x 5 columns]

In [32]:
model.predict([[3,41.0,7.125,0,1]])[0]

0

In [33]:
model.predict([[3,20,7.925,0,1]])[0]

0

In [35]:
model.predict(x_test.head(10))

array([0, 0, 0, 0, 0, 1, 1, 1, 1, 0], dtype=int64)

In [36]:
model.predict_proba(x_test.head(10))

array([[0.98849132, 0.01150868],
       [0.98580531, 0.01419469],
       [0.97412504, 0.02587496],
       [0.8910435 , 0.1089565 ],
       [0.97191176, 0.02808824],
       [0.0035828 , 0.9964172 ],
       [0.00435023, 0.99564977],
       [0.07523027, 0.92476973],
       [0.02999207, 0.97000793],
       [0.97343153, 0.02656847]])